#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_key_vault_certificate.foo: Still reading... [10s elapsed]
data.azurerm_key_vault_certificate.foo: Still reading... [20s elapsed]
data.azurerm_key_vault_certificate.foo: Still reading... [30s elapsed]
data.azurerm_key_vault_certificate.foo: Still reading... [40s elapsed]
data.azurerm_key_vault_certificate.foo: Still reading... [50s elapsed]
data.azurerm_key_vault_certificate.foo: Still reading... [1m0s elapsed]
Error: reading Key Vault Certificate: keyvault.BaseClient#GetCertificate: Failure responding to request: StatusCode=403 -- Original Error: autorest/azure: Service returned an error. Status=403 Code="Forbidden" Message="The user, group or application 'appid=64471758-5307-4621-8e6a-44665c3affa2;oid=547c5240-b77f-4ece-a82f-293ec05397c1;numgroups=2;iss=https://sts.windows.net/7788edaf-0346-4068-9d79-c868aed15b3d/' does not have certificates get permission on key vault 'io-p-kv;location=westeurope'. For help resolving this issue, please see https://go.microsoft.com/fwlink/?linkid=2125287" InnerError={"code":"AccessDenied"}

  with data.azurerm_key_vault_certificate.foo,
  on data.tf line 101, in data "azurerm_key_vault_certificate" "foo":
 101: data "azurerm_key_vault_certificate" "foo" {

rceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/b0645ff1-a129-1fc9-49ec-96b7c6297825]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
data.azurerm_key_vault_certificate.foo: Still reading... [1m10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.key_vaults.module.key_vault_role_assignments.azurerm_role_assignment.certificates["io-p-sec-rg|io-p-kv|reader"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + condition_version                = (known after apply)
      + description                      = "It is required so the CDN can get the certificates stored in the key vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7a1ef28a-d63c-47d2-be10-98cb7b66a1b9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificate User"
      + scope                            = "/subscriptions//subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_storage_container.well_known,
  on ../_modules/cdn/storage_account.tf line 29, in resource "azurerm_storage_container" "well_known":
  29:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
